In [1]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt
from util import truncate

In [2]:
pd.set_option('display.max_columns', None)

In [16]:
ksi_df = pd.read_csv('Data/KSI.csv')

In [19]:
# empty column just made so that we can take count in pivot table

ksi_df['COUNT'] = 1

In [16]:
accnum_list = ksi_df['ACCNUM'].unique()

In [18]:
len(accnum_list)

6002

In [17]:
ksi_df['LATITUDE'] = ksi_df['LATITUDE'].apply(truncate, args = (2,))
ksi_df['LONGITUDE'] = ksi_df['LONGITUDE'].apply(truncate, args = (2,))

In [20]:
ksi_collapse = ksi_df.loc[ksi_df['ACCNUM'].drop_duplicates().index].pivot_table(values = ['COUNT'], index = ['LATITUDE', 'LONGITUDE'], aggfunc = 'count')

In [21]:
ksi_collapse.reset_index(inplace = True)

In [22]:
ksi_collapse

     LATITUDE  LONGITUDE  COUNT
0       43.59     -79.54      4
1       43.59     -79.53     11
2       43.59     -79.52      5
3       43.59     -79.51      6
4       43.59     -79.50      1
..        ...        ...    ...
683     43.84     -79.19      2
684     43.85     -79.19      1
685     43.85     -79.18      1
686     43.85     -79.17      5
687     43.85     -79.16      1

[688 rows x 3 columns]

In [10]:
# this latitude and longitude has 2 accidents

ksi_df[(ksi_df['LATITUDE'] == 43.853) & (ksi_df['LONGITUDE'] == -79.179)]

,X,Y,INDEX_,ACCNUM,YEAR,DATE,TIME,HOUR,STREET1,STREET2,...,SPEEDING,AG_DRIV,REDLIGHT,ALCOHOL,DISABILITY,POLICE_DIVISION,HOOD_ID,NEIGHBOURHOOD,ObjectId,COUNT
2270,-8.814276e+06,5.442744e+06,4274318,1000440,2007,2007/10/21 04:00:00+00,1449,14,STEELES Aven E,BEARE Road,...,<Null>,Yes,<Null>,<Null>,<Null>,D42,131,Rouge (131),2271,1
2278,-8.814276e+06,5.442744e+06,4274319,1000440,2007,2007/10/21 04:00:00+00,1449,14,STEELES Aven E,BEARE Road,...,<Null>,Yes,<Null>,<Null>,<Null>,D42,131,Rouge (131),2279,1
2456,-8.814276e+06,5.442744e+06,4196587,981104,2007,2007/06/23 04:00:00+00,1000,10,STEELES AVE E,BEARE RD,...,<Null>,Yes,<Null>,<Null>,<Null>,D42,131,Rouge (131),2457,1
2461,-8.814276e+06,5.442744e+06,4196588,981104,2007,2007/06/23 04:00:00+00,1000,10,STEELES AVE E,BEARE RD,...,<Null>,Yes,<Null>,<Null>,<Null>,D42,131,Rouge (131),2462,1
2466,-8.814276e+06,5.442744e+06,4196589,981104,2007,2007/06/23 04:00:00+00,1000,10,STEELES AVE E,BEARE RD,...,<Null>,Yes,<Null>,<Null>,<Null>,D42,131,Rouge (131),2467,1
2472,-8.814276e+06,5.442744e+06,4196590,981104,2007,2007/06/23 04:00:00+00,1000,10,STEELES AVE E,BEARE RD,...,<Null>,Yes,<Null>,<Null>,<Null>,D42,131,Rouge (131),2473,1

In [23]:
ksi_collapse.to_csv('KSI_Collapse_Count_round2.csv')